## Getting started 

As a data scientist you have been tasked with creating predicting the salary of data professionals, the data consits slaries of data scientists, data analysts and data engineers in various cities in India 2022. You can view the positions provided and locations in the `info.txt`
The model your are to create should learn from the data provided.

### Understanding the question
The first stpe towards building a succesful model is understanding the business objective, building a machine learnning model is not the end goal but rather a means to the end goal. 

The first question we will ask ourselves is what will our model output? for our model we will be aiming to predict the salary of a data professional given the other features. Understandng the output will enable us to select algorithm for use and the features we will use. 

The next question we will ask ourselves is what is the current solution implemented to solve the problem we are trying to solve and how will our new solution defer from the current implemented solution.

With all these questions answered we will then move on to categorize our probelem whether its a supervised, unsupervised or reinforcement leraning? is it a classification or regression problem? Should we implement batch or online learning techniques? we will then move on and answer these questions.
Since we rae given labelled data we our problem is a supervised learning problem the salaries of individual observations are given. Its also a multivariate regression task since we wil be predicting a value and will be using multiple features to implement our prediction. We will also not e having data flowing into the system we will be implementing a batch learning.

## Getting the data

In [3]:
#importing the modules
import pandas as pd
import numpy as np
import requests


#getting the data
df = pd.read_csv("./introduction/data/salary.csv")

#taking a look at the data
df.head(10)

,Company Name,Job Title,Salaries Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr"
5,Infosys,Data Scientist,30.0,Bangalore,"₹9,08,764/yr"
6,Capgemini,Data Scientist,28.0,Bangalore,"₹9,26,124/yr"
7,Cognizant Technology Solutions,Data Scientist,26.0,Bangalore,"₹7,36,708/yr"
8,Anheuser-Busch InBev,Data Scientist,25.0,Bangalore,"₹16,46,721/yr"
9,Fractal,Data Scientist,22.0,Bangalore,"₹13,92,960/yr"

We wil then get the general info about our data using the `info()` method in python.

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4344 entries, 0 to 4343
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Company Name       4341 non-null   object
 1   Job Title          4344 non-null   object
 2   Salaries Reported  4342 non-null   float64
 3   Location           4344 non-null   object
 4   Salary             4344 non-null   object
dtypes: float64(1), object(4)
memory usage: 169.8+ KB

Ou data has five features, our dependet cariable is salary and independet variables are compnay name job tile , salaries reported and location.

## Data cleaning

we will convert our salary column into a numeric type we will do this by replacing some of he characters in the stings.

In [9]:
df.head()

,Company Name,Job Title,Salaries Reported,Location,Salary
0,Mu Sigma,Data Scientist,105.0,Bangalore,"₹6,48,573/yr"
1,IBM,Data Scientist,95.0,Bangalore,"₹11,91,950/yr"
2,Tata Consultancy Services,Data Scientist,66.0,Bangalore,"₹8,36,874/yr"
3,Impact Analytics,Data Scientist,40.0,Bangalore,"₹6,69,578/yr"
4,Accenture,Data Scientist,32.0,Bangalore,"₹9,44,110/yr"

In [5]:
df.describe()

       Salaries Reported
count        4342.000000
mean            2.775910
std             5.146527
min             1.000000
25%             1.000000
50%             1.000000
75%             3.000000
max           105.000000

In [18]:
#changing data type of salary
y = []
for i in df["Salary"]:
    t = i.replace(",", "")
    u = t.replace("/yr", "")
    e = u.replace("$", "")
    q = e.replace("£", "")
    w = q.replace("AFN", "")
    h = w.replace("₹", "")
    # if "/mo" not in h:
    #     y.append(int(h))
    if "/mo" in h:
        l = h.replace("/mo", "")
        y.append(int(l) * 12)
    elif "/hr" in h:
        s = h.replace("/hr", "") 
        y.append(int(s) * 8 * 5 * 52)  
    else:
        y.append(int(h))

In [20]:
df["Salary"] = y

In [28]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

In [31]:
df.columns

Index(['Company Name', 'Job Title', 'Salaries Reported', 'Location', 'Salary'], dtype='object')

In [38]:
encoder = LabelEncoder()

df_cat = df["Job Title"].ravel()
df_cat_encoded = encoder.fit_transform(df_cat)

array([ 8,  8,  8, ..., 18, 25, 19])

In [ ]:
import

In [27]:
train_set, test_set = train_test_split(df, test_size = 0.2, random_state=42)